// 无眠纪 — 敌人图鉴数据
// Part of TDE_DATA. Edit directly or use the web UI.

TDE_DATA.bosses = [];

TDE_DATA.elites = [
  {
    "id": "new_elite_1785251004235",
    "name": "卫道士",
    "faction": "灾厄军团",
    "desc": "体内厄法失控暴走的灾厄战士。体内汹涌的厄法使他们的皮肤坚不可摧，穿着的拘束服可压制其体内的厄法。",
    "race": "race-willie",
    "lore": "并非所有维利人都能很好地控制厄法。部分维利人在受赐厄法后，会遭到厄法的反噬——他们的躯体过度膨胀与扭曲，同时丧失理智。好在灾厄术士们早有准备，特制的拘束服可将失控的厄法完美压制，使其成为军团的一大助力，并受封为卫道士。\n\n卫道士通常被派驻于维利人的灾厄教堂，其高大的身躯足以震慑整座教堂，这也是他们被称为“卫道士”的原因。\n\n若拘束服破裂，失控的厄法会将卫道士扭曲为……"
  }
];

TDE_DATA.common = [];
