// 无眠纪 — 敌人图鉴数据
// Part of TDE_DATA. Edit directly or use the web UI.

TDE_DATA.bosses = [];

TDE_DATA.elites = [
  {
    "id": "new_elite_1785251004235",
    "name": "卫道士",
    "faction": "灾厄军团",
    "desc": "体内厄法失控暴走的灾厄战士。体内汹涌的厄法使他们的皮肤坚不可摧，穿着的拘束服可压制其体内的厄法。",
    "race": "race-willie",
    "lore": "并非所有维利人都能很好地控制厄法。部分维利人在受赐厄法后，会遭到厄法的反噬——他们的躯体过度膨胀与扭曲，同时丧失理智。好在灾厄术士们早有准备，特制的拘束服可将失控的厄法完美压制，使其成为军团的一大助力，并受封为卫道士。\n\n卫道士通常被派驻于维利人的灾厄教堂，其高大的身躯足以震慑整座教堂，这也是他们被称为“卫道士”的原因。\n\n若拘束服破裂，失控的厄法会将卫道士扭曲为……"
  },
  {
    "id": "new_elite_1785299119916",
    "name": "掘进者",
    "faction": "灾厄军团",
    "desc": "由咒贤直接支配的高阶厄兽，负责打通后勤隧道，并为咒贤四处掠夺尸体以供研究。",
    "lore": "作为位阶极高的厄兽，掘进者本身便具备召唤低阶厄兽仆从的能力，并能自如使用厄法。它以巨嘴吞食土石，在地下掘进隧道。然而，隧道空间狭小，不适宜军队通行，且掘进时声响巨大，难以用于战场奇袭。不过，若在打通后的隧道中铺设轨道，便可极大便利后勤运输。\n\n咒贤常派遣掘进者前往偏远之地，掠夺无主尸体，以供研究之用。",
    "race": "race-brute"
  }
];

TDE_DATA.common = [
  {
    "id": "new_common_1785299208702",
    "name": "掠夺者",
    "faction": "灾厄军团",
    "desc": "灾厄军团的常规单位，配备有制式化的的装备。",
    "race": "race-willie"
  }
];
