// 无眠纪 — 区域与世界地图数据
// Part of TDE_DATA. Edit directly or use the web UI.

TDE_DATA.regions = [
  {
    "name": "北风前哨站",
    "level": "1-10",
    "desc": "位于极北之地的巨型建筑，是剑王时代建造用于监控北风的巨型设施，由窃魂者们世代镇守，窃魂者们从此处出发不断进行远征以寻求消除北风的方法，同时在前哨站内建设研究所寻求与北风共存的可能性。",
    "tags": [],
    "landmarks": [
      {
        "name": "地下矿坑",
        "desc": "窃魂者们开采矿石的主要地点，窃魂者们在此开采矿石用作建设前哨站以及打造武器装备"
      },
      {
        "name": "远征档案馆",
        "desc": "存储着每次远征记录的巨型档案馆，北风前哨站陷落后一直由档案管理员及其死灵仆从照料，因此馆内资料大多得以妥善保管"
      },
      {
        "name": "居住区",
        "desc": "窃魂者们及非窃魂者人员居住的地方，多由简易民房及宿舍组成，中央有一台大型熔岩锅炉"
      },
      {
        "name": "仪式广场",
        "desc": "举行授火仪式的广场，也是整个北风前哨站的核心，广场下连接着巨大的熔岩管道用于给仪式提供所需的庞大能量"
      },
      {
        "name": "瞭望塔",
        "desc": "观察北风状况的地方，也是站长及其他行政人员的办公场所，用于规划下一次远征的路线以及维持北风前哨站的运行"
      },
      {
        "name": "研究院",
        "desc": "学者们在此通过模拟北风的环境来研究与北风共存的方法，包括但不限于新的建筑材料、取暖方式、人体改造、作物培育"
      }
    ],
    "bosses": [
      "无"
    ],
    "route": {
      "nodes": [],
      "edges": []
    },
    "connections": [],
    "id": "北风前哨站"
  },
  {
    "name": "海潮镇",
    "level": "1-10",
    "desc": "王国边陲的港口城市，无眠纪到来后镇民选择接受深海中先驱的赐福，成为鱼群的一部分。",
    "tags": [],
    "landmarks": [
      {
        "name": "雾港",
        "desc": "海潮镇的港口兼主要聚居地"
      },
      {
        "name": "潮声酒馆",
        "desc": "镇上唯一的消遣场所。这里不提供灯光和音乐，只有酒客们面无表情地啜饮着劣质的酒水"
      },
      {
        "name": "双子塔楼",
        "desc": "内设有盐渍厂，用于生产盐渍风干的鱼肉，作为居民的日常口粮"
      },
      {
        "name": "深潮修道院",
        "desc": "祭司和高级信徒的居所，它不是那种明亮的教堂，而是半埋没在山石间的下沉式建筑"
      },
      {
        "name": "废弃灯塔",
        "desc": "在小镇的最边缘，是一座早已废弃的灯塔"
      }
    ],
    "bosses": [
      "无"
    ],
    "route": {
      "nodes": [],
      "edges": []
    },
    "connections": [],
    "id": "海潮镇"
  },
  {
    "name": "熔岩遗迹",
    "level": "1-10",
    "desc": "XXXXX",
    "tags": [],
    "landmarks": [],
    "bosses": [
      "无"
    ],
    "route": {
      "nodes": "",
      "edges": ""
    },
    "connections": [],
    "id": "XXXXX_1785248577576"
  },
  {
    "name": "朽木沼泽",
    "level": "1-10",
    "desc": "XXXXX",
    "tags": [],
    "landmarks": [],
    "bosses": [
      "无"
    ],
    "route": {
      "nodes": [],
      "edges": []
    },
    "connections": [],
    "id": "XXXXX_1785248567069"
  }
];

TDE_DATA.worldMap = {
  "nodes": {
    "北风前哨站": {
      "x": 520,
      "y": 40,
      "color": "#e0e0e0",
      "size": "xlarge",
      "style": "default"
    },
    "海潮镇": {
      "x": 500,
      "y": 440,
      "color": "#00f0ff",
      "size": "medium",
      "style": "default"
    },
    "朽木沼泽": {
      "x": 560,
      "y": 240,
      "color": "#ff6b35",
      "size": "medium",
      "style": "default"
    },
    "熔岩遗迹": {
      "x": 520,
      "y": 100,
      "color": "#ff6b35",
      "size": "medium",
      "style": "dashed"
    }
  }
};
